#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mmodule.k3s.module.infra.data.hcloud_location.loc: Reading...[0m[0m
[0m[1mmodule.k3s.module.infra.data.hcloud_location.loc: Read complete after 1s [name=fsn1][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # null_resource.custom[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "custom" {
      [32m+[0m[0m id = (known after apply)
    }

[1m  # module.k3s.module.infra.hcloud_firewall.default_firewall[0m will be created
[0m  [32m+[0m[0m resource "hcloud_firewall" "default_firewall" {
      [32m+[0m[0m id     = (known after apply)
      [32m+[0m[0m labels = (known after apply)
      [32m+[0m[0m name   = "k3s-arm-firewall"

      [32m+[0m[0m rule {
          [32m+[0m[0m description     = "allow all TCP on internal network"
          [32m+[0m[0m destination_ips = []
          [32m+[0m[0m direction       = "in"
          [32m+[0m[0m port            = "any"
          [32m+[0m[0m protocol        = "tcp"
          [32m+[0m[0m source_ips      = [
              [32m+[0m[0m "10.0.0.0/16",
            ]
        }
      [32m+[0m[0m rule {
          [32m+[0m[0m description     = "allow all UDP on internal network"
          [32m+[0m[0m destination_ips = []
          [32m+[0m[0m direction       = "in"
          [32m+[0m[0m port            = "any"
          [32m+[0m[0m protocol        = "udp"
          [32m+[0m[0m source_ips      = [
              [32m+[0m[0m "10.0.0.0/16",
            ]
        }
      [32m+[0m[0m rule {
          [32m+[0m[0m description     = "allow icmp (ping)"
          [32m+[0m[0m destination_ips = []
          [32m+[0m[0m direction       = "in"
          [32m+[0m[0m protocol        = "icmp"
          [32m+[0m[0m source_ips      = [
              [32m+[0m[0m "0.0.0.0/0",
              [32m+[0m[0m "::/0",
            ]
        }
      [32m+[0m[0m rule {
          [32m+[0m[0m description     = "allow ssh access"
          [32m+[0m[0m destination_ips = []
          [32m+[0m[0m direction       = "in"
          [32m+[0m[0m port            = "22"
          [32m+[0m[0m protocol        = "tcp"
          [32m+[0m[0m source_ips      = [
              [32m+[0m[0m "0.0.0.0/0",
              [32m+[0m[0m "::/0",
            ]
        }
    }

[1m  # module.k3s.module.infra.hcloud_load_balancer.api_load_balancer[0m will be created
[0m  [32m+[0m[0m resource "hcloud_load_balancer" "api_load_balancer" {
      [32m+[0m[0m delete_protection  = false
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m ipv4               = (known after apply)
      [32m+[0m[0m ipv6               = (known after apply)
      [32m+[0m[0m labels             = (known after apply)
      [32m+[0m[0m load_balancer_type = "lb11"
      [32m+[0m[0m location           = "fsn1"
      [32m+[0m[0m name               = "k3s-arm-api-lb"
      [32m+[0m[0m network_id         = (known after apply)
      [32m+[0m[0m network_ip         = (known after apply)
      [32m+[0m[0m network_zone       = (known after apply)
    }

[1m  # module.k3s.module.infra.hcloud_load_balancer_network.srvnetwork[0m will be created
[0m  [32m+[0m[0m resource "hcloud_load_balancer_network" "srvnetwork" {
      [32m+[0m[0m enable_public_interface = true
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m ip                      = "10.0.0.5"
      [32m+[0m[0m load_balancer_id        = (known after apply)
      [32m+[0m[0m network_id              = (known after apply)
    }

[1m  # module.k3s.module.infra.hcloud_load_balancer_service.load_balancer_service[0m will be created
[0m  [32m+[0m[0m resource "hcloud_load_balancer_service" "load_balancer_service" {
      [32m+[0m[0m destination_port = 6443
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m listen_port      = 6443
      [32m+[0m[0m load_balancer_id = (known after apply)
      [32m+[0m[0m protocol         = "tcp"
      [32m+[0m[0m proxyprotocol    = (known after apply)
    }

[1m  # module.k3s.module.infra.hcloud_load_balancer_target.api_load_balancer_target[0m will be created
[0m  [32m+[0m[0m resource "hcloud_load_balancer_target" "api_load_balancer_target" {
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m label_selector   = "node-type=k3s-arm-main"
      [32m+[0m[0m load_balancer_id = (known after apply)
      [32m+[0m[0m type             = "label_selector"
      [32m+[0m[0m use_private_ip   = true
    }

[1m  # module.k3s.module.infra.hcloud_network.network[0m will be created
[0m  [32m+[0m[0m resource "hcloud_network" "network" {
      [32m+[0m[0m delete_protection        = false
      [32m+[0m[0m expose_routes_to_vswitch = false
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m ip_range                 = "10.0.0.0/16"
      [32m+[0m[0m name                     = "k3s-arm-net"
    }

[1m  # module.k3s.module.infra.hcloud_network_subnet.network-subnet[0m will be created
[0m  [32m+[0m[0m resource "hcloud_network_subnet" "network-subnet" {
      [32m+[0m[0m gateway      = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m ip_range     = "10.0.0.0/16"
      [32m+[0m[0m network_id   = (known after apply)
      [32m+[0m[0m network_zone = "eu-central"
      [32m+[0m[0m type         = "cloud"
    }

[1m  # module.k3s.module.infra.hcloud_placement_group.main[0m will be created
[0m  [32m+[0m[0m resource "hcloud_placement_group" "main" {
      [32m+[0m[0m id      = (known after apply)
      [32m+[0m[0m name    = "k3s-arm-main-group"
      [32m+[0m[0m servers = (known after apply)
      [32m+[0m[0m type    = "spread"
    }

[1m  # module.k3s.module.infra.hcloud_placement_group.worker[0m will be created
[0m  [32m+[0m[0m resource "hcloud_placement_group" "worker" {
      [32m+[0m[0m id      = (known after apply)
      [32m+[0m[0m name    = "k3s-arm-worker-group"
      [32m+[0m[0m servers = (known after apply)
      [32m+[0m[0m type    = "spread"
    }

[1m  # module.k3s.module.infra.hcloud_server.main-node[0][0m will be created
[0m  [32m+[0m[0m resource "hcloud_server" "main-node" {
      [32m+[0m[0m allow_deprecated_images    = false
      [32m+[0m[0m backup_window              = (known after apply)
      [32m+[0m[0m backups                    = false
      [32m+[0m[0m datacenter                 = (known after apply)
      [32m+[0m[0m delete_protection          = false
      [32m+[0m[0m firewall_ids               = (known after apply)
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m ignore_remote_firewall_ids = false
      [32m+[0m[0m image                      = "debian-11"
      [32m+[0m[0m ipv4_address               = (known after apply)
      [32m+[0m[0m ipv6_address               = (known after apply)
      [32m+[0m[0m ipv6_network               = (known after apply)
      [32m+[0m[0m keep_disk                  = false
      [32m+[0m[0m labels                     = {
          [32m+[0m[0m "node-type" = "k3s-arm-main"
        }
      [32m+[0m[0m location                   = "fsn1"
      [32m+[0m[0m name                       = "k3s-arm-main-0"
      [32m+[0m[0m placement_group_id         = (known after apply)
      [32m+[0m[0m rebuild_protection         = false
      [32m+[0m[0m server_type                = "cax11"
      [32m+[0m[0m ssh_keys                   = [
          [32m+[0m[0m "k3s-arm-ssh",
        ]
      [32m+[0m[0m status                     = (known after apply)
      [32m+[0m[0m user_data                  = "1T0ydPTdZZkOtTodLjveqBHOwf8="
    }

[1m  # module.k3s.module.infra.hcloud_server.worker-node[0][0m will be created
[0m  [32m+[0m[0m resource "hcloud_server" "worker-node" {
      [32m+[0m[0m allow_deprecated_images    = false
      [32m+[0m[0m backup_window              = (known after apply)
      [32m+[0m[0m backups                    = false
      [32m+[0m[0m datacenter                 = (known after apply)
      [32m+[0m[0m delete_protection          = false
      [32m+[0m[0m firewall_ids               = (known after apply)
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m ignore_remote_firewall_ids = false
      [32m+[0m[0m image                      = "debian-11"
      [32m+[0m[0m ipv4_address               = (known after apply)
      [32m+[0m[0m ipv6_address               = (known after apply)
      [32m+[0m[0m ipv6_network               = (known after apply)
      [32m+[0m[0m keep_disk                  = false
      [32m+[0m[0m labels                     = {
          [32m+[0m[0m "node-type" = "k3s-arm-worker"
        }
      [32m+[0m[0m location                   = "fsn1"
      [32m+[0m[0m name                       = "k3s-arm-worker-0"
      [32m+[0m[0m placement_group_id         = (known after apply)
      [32m+[0m[0m rebuild_protection         = false
      [32m+[0m[0m server_type                = "cax11"
      [32m+[0m[0m ssh_keys                   = [
          [32m+[0m[0m "k3s-arm-ssh",
        ]
      [32m+[0m[0m status                     = (known after apply)
      [32m+[0m[0m user_data                  = "1T0ydPTdZZkOtTodLjveqBHOwf8="
    }

[1m  # module.k3s.module.infra.hcloud_server.worker-node[1][0m will be created
[0m  [32m+[0m[0m resource "hcloud_server" "worker-node" {
      [32m+[0m[0m allow_deprecated_images    = false
      [32m+[0m[0m backup_window              = (known after apply)
      [32m+[0m[0m backups                    = false
      [32m+[0m[0m datacenter                 = (known after apply)
      [32m+[0m[0m delete_protection          = false
      [32m+[0m[0m firewall_ids               = (known after apply)
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m ignore_remote_firewall_ids = false
      [32m+[0m[0m image                      = "debian-11"
      [32m+[0m[0m ipv4_address               = (known after apply)
      [32m+[0m[0m ipv6_address               = (known after apply)
      [32m+[0m[0m ipv6_network               = (known after apply)
      [32m+[0m[0m keep_disk                  = false
      [32m+[0m[0m labels                     = {
          [32m+[0m[0m "node-type" = "k3s-arm-worker"
        }
      [32m+[0m[0m location                   = "fsn1"
      [32m+[0m[0m name                       = "k3s-arm-worker-1"
      [32m+[0m[0m placement_group_id         = (known after apply)
      [32m+[0m[0m rebuild_protection         = false
      [32m+[0m[0m server_type                = "cax11"
      [32m+[0m[0m ssh_keys                   = [
          [32m+[0m[0m "k3s-arm-ssh",
        ]
      [32m+[0m[0m status                     = (known after apply)
      [32m+[0m[0m user_data                  = "1T0ydPTdZZkOtTodLjveqBHOwf8="
    }

[1m  # module.k3s.module.infra.hcloud_server_network.main-node-network[0][0m will be created
[0m  [32m+[0m[0m resource "hcloud_server_network" "main-node-network" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m ip          = "10.0.0.10"
      [32m+[0m[0m mac_address = (known after apply)
      [32m+[0m[0m network_id  = (known after apply)
      [32m+[0m[0m server_id   = (known after apply)
    }

[1m  # module.k3s.module.infra.hcloud_server_network.worker-node-network[0][0m will be created
[0m  [32m+[0m[0m resource "hcloud_server_network" "worker-node-network" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m ip          = "10.0.0.100"
      [32m+[0m[0m mac_address = (known after apply)
      [32m+[0m[0m network_id  = (known after apply)
      [32m+[0m[0m server_id   = (known after apply)
    }

[1m  # module.k3s.module.infra.hcloud_server_network.worker-node-network[1][0m will be created
[0m  [32m+[0m[0m resource "hcloud_server_network" "worker-node-network" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m ip          = "10.0.0.101"
      [32m+[0m[0m mac_address = (known after apply)
      [32m+[0m[0m network_id  = (known after apply)
      [32m+[0m[0m server_id   = (known after apply)
    }

[1m  # module.k3s.module.infra.hcloud_ssh_key.default[0m will be created
[0m  [32m+[0m[0m resource "hcloud_ssh_key" "default" {
      [32m+[0m[0m fingerprint = (known after apply)
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m name        = "k3s-arm-ssh"
      [32m+[0m[0m public_key  = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC7VuYtXSdXGkxtT1134XWAktxgemzHzEVQmmUhJuHivzTxK2taWK/Gv7TC61sxuDJtK6aG391Slsy2kvPQW+1z2AUBNsmvHUbjMAQir5DJvCXHakn3IZctM9IRoIosG1s8dQQVEFya3rz62UiZfBXrdGHuZVtYDyoyRrVq2rsUmq4r9hNSqrGaoyZsDOf0TERmPlIIy7EFUp1bVko+a1I7CiiztaGcoha2ZE/hQd3+fWGcXQKV6RlZlU46ecbmX+OnAVcQkoZseJiNt3ckJC0filsQjk4+7ZbvnEgNhy0G9/3zhc4plRHWSwiKGvPqWlYiVKRjBtfJYTXRMJ2oHeJ0lucJ0gdWwzIfTvixe628mThY1nMZczrME78TxPLOP6SIRbJmBRJtB2WfxUoN1hfMPjBgxttKY5fo8QxIs+Xj1PhcxtfIKeO+TkLGlWHZ/bbS2/6pRkXxJ2ryoJMNsHWrIXW9KfkiqLH2ifec+t/fPdtBA4KM+lw6RoILCLky4yk= andrzej@macbook-esky.local
        EOT
    }

[1m  # module.k3s.module.k3s.null_resource.ccm[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "ccm" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "first_main_ip" = (known after apply)
        }
    }

[1m  # module.k3s.module.k3s.null_resource.cluster_init[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "cluster_init" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "first_main_ip" = (known after apply)
        }
    }

[1m  # module.k3s.module.k3s.null_resource.csi[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "csi" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "first_main_ip" = (known after apply)
        }
    }

[1m  # module.k3s.module.k3s.null_resource.k3s_upgrade[0][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "k3s_upgrade" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "upgrade_k3s" = "v1.26.4+k3s1"
        }
    }

[1m  # module.k3s.module.k3s.null_resource.upgrade_controller[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "upgrade_controller" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "first_main_ip" = (known after apply)
        }
    }

[1m  # module.k3s.module.k3s.null_resource.worker_init[0][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "worker_init" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "worker_ip" = (known after apply)
        }
    }

[1m  # module.k3s.module.k3s.null_resource.worker_init[1][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "worker_init" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "worker_ip" = (known after apply)
        }
    }

[1m  # module.k3s.module.k3s.random_id.k3s_token[0m will be created
[0m  [32m+[0m[0m resource "random_id" "k3s_token" {
      [32m+[0m[0m b64_std     = (known after apply)
      [32m+[0m[0m b64_url     = (known after apply)
      [32m+[0m[0m byte_length = 8
      [32m+[0m[0m dec         = (known after apply)
      [32m+[0m[0m hex         = (known after apply)
      [32m+[0m[0m id          = (known after apply)
    }

[1mPlan:[0m 25 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @AndrzejOlender, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*